tests/load-test.yml
config:
  target: 'http://localhost:3001'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    # Ramp-up phase  
    - duration: 300
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up"
    # Sustained load phase
    - duration: 600
      arrivalRate: 50
      name: "Sustained load"
    # Peak load phase
    - duration: 180
      arrivalRate: 100
      name: "Peak load"
    # Cool-down phase
    - duration: 120
      arrivalRate: 100
      rampTo: 10
      name: "Cool-down"
  
  defaults:
    headers:
      'Content-Type': 'application/json'
      'User-Agent': 'Artillery Load Test'
  
  # Performance thresholds
  ensure:
    maxErrorRate: 1
    p95: 500  # 95th percentile response time under 500ms
    p99: 1000 # 99th percentile response time under 1s

  # Load test processor
  processor: "./tests/load-test-functions.js"

scenarios:
  # Public endpoints (no auth required)
  - name: "Public API Endpoints"
    weight: 30
    flow:
      - get:
          url: "/api/health"
          capture:
            - json: "$.status"
              as: "healthStatus"
      - get:
          url: "/api/restaurants"
          query:
            limit: 20
          capture:
            - json: "$.restaurants[0].id"
              as: "restaurantId"
      - get:
          url: "/api/restaurants/{{ restaurantId }}"
          ifTrue: "restaurantId"
      - post:
          url: "/api/restaurants/{{ restaurantId }}/availability"
          ifTrue: "restaurantId"
          json:
            date: "{{ $randomDate() }}"
            time: "19:00"
            partySize: "{{ $randomInt(1, 8) }}"

  # User authentication flow
  - name: "User Authentication"
    weight: 20
    flow:
      - post:
          url: "/api/auth/register"
          json:
            email: "loadtest{{ $randomString() }}@example.com"
            password: "LoadTest123!"
            name: "Load Test User {{ $randomInt(1, 10000) }}"
          capture:
            - json: "$.user.id"
              as: "userId"
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "LoadTest123!"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/users/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ifTrue: "authToken"

  # Reservation workflow
  - name: "Reservation Workflow"
    weight: 25
    flow:
      # Login first
      - function: "generateTestUser"
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ testEmail }}"
            password: "{{ testPassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      # Search restaurants
      - get:
          url: "/api/restaurants"
          query:
            cuisine: "{{ $randomElement(['Italian', 'French', 'American', 'Chinese', 'Mexican']) }}"
            limit: 10
          capture:
            - json: "$.restaurants[0].id"
              as: "restaurantId"
      
      # Check availability
      - post:
          url: "/api/restaurants/{{ restaurantId }}/availability"
          ifTrue: "restaurantId"
          json:
            date: "{{ $randomFutureDate() }}" 
            time: "{{ $randomElement(['18:00', '19:00', '20:00', '21:00']) }}"
            partySize: "{{ $randomInt(1, 6) }}"
          capture:
            - json: "$.availableTimes[0]"
              as: "availableTime"
      
      # Make reservation
      - post:
          url: "/api/reservations"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            restaurantId: "{{ restaurantId }}"
            dateTime: "{{ availableTime }}"
            partySize: "{{ partySize }}"
            specialRequests: "Load test reservation"
          capture:
            - json: "$.reservation.id"
              as: "reservationId"
          ifTrue: "authToken && restaurantId && availableTime"
      
      # View reservation
      - get:
          url: "/api/reservations/{{ reservationId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ifTrue: "authToken && reservationId"

  # User features testing
  - name: "User Features"
    weight: 15
    flow:
      # Login
      - function: "generateTestUser"
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ testEmail }}"
            password: "{{ testPassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      # Get random restaurant
      - get:
          url: "/api/restaurants"
          query:
            limit: 1
            offset: "{{ $randomInt(0, 100) }}"
          capture:
            - json: "$.restaurants[0].id"
              as: "restaurantId"
      
      # Add to favorites
      - post:
          url: "/api/favorites"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            restaurantId: "{{ restaurantId }}"
            tags: ["load-test"]
            notes: "Load test favorite"
          ifTrue: "authToken && restaurantId"
      
      # Get favorites
      - get:
          url: "/api/favorites"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ifTrue: "authToken"
      
      # Add dining history
      - post:
          url: "/api/dining-history"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            restaurantId: "{{ restaurantId }}"
            visitDate: "{{ $randomPastDate() }}"
            rating: "{{ $randomInt(3, 5) }}"
            review: "Load test dining experience"
            dishes:
              - name: "Test Dish"
                rating: "{{ $randomInt(3, 5) }}"
          ifTrue: "authToken && restaurantId"
      
      # Get notifications
      - get:
          url: "/api/notifications"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ifTrue: "authToken"

  # Search and discovery
  - name: "Search and Discovery"
    weight: 10
    flow:
      - get:
          url: "/api/restaurants/search"
          query:
            q: "{{ $randomElement(['pizza', 'pasta', 'burger', 'sushi', 'steak']) }}"
            location: "{{ $randomElement(['New York', 'San Francisco', 'Los Angeles', 'Chicago']) }}"
            cuisine: "{{ $randomElement(['Italian', 'American', 'Asian', 'French']) }}"
            minRating: "{{ $randomElement([3, 4]) }}"
      
      - get:
          url: "/api/restaurants"
          query:
            sortBy: "{{ $randomElement(['rating', 'distance', 'price', 'popularity']) }}"
            priceRange: "{{ $randomElement(['$', '$$', '$$$']) }}"
            limit: 20